---
kind: property
id: P:Autodesk.Revit.DB.Electrical.AreaBasedLoadData.LoadType
source: html/b79b90be-ee42-2617-20ea-88d665f40edb.htm
---
# Autodesk.Revit.DB.Electrical.AreaBasedLoadData.LoadType Property

The load type of the area based load.

## Syntax (C#)
```csharp
public ElectricalLoadType LoadType { get; }
```